c_notes.html
<!DOCTYPE html>
<html>
<head>
<title>C Notes</title>
<!-- 2015-04-19 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Mark Wallace">
<link rel="Stylesheet" type="text/css" href="assets/css/style.css"/>
</head>
<body>
<div id="preamble" class="status">
<!--<body onload="prettyPrint()">-->
<nav>
    <a href="index.html">Index</a>
    <a href="about.html">About</a>
    <a href="https://lotabout.github.io">Blog</a>
    <a href="sitemap.html">SiteMap</a>
</nav>
</div>
<div id="content">
<h1 class="title">C Notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">FAQs</a>
<ul>
<li><a href="#sec-1-1">How to cast function pointer</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Different to C++ Notes, this page concern only C-related questions.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">FAQs</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">How to cast function pointer</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The requirement is as follows: If you got a function that need a
callback function:
</p>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #8cd0d3;">void</span> <span style="color: #8cd0d3;">process</span>(<span style="color: #8cd0d3;">void</span> (*<span style="color: #dfaf8f;">callback</span>)(<span style="color: #8cd0d3;">void</span> *))
</pre>
</div>
<p>
Note here that callback can have one argument which is type <code>void
*</code>. Now perhaps we have our own version of callback function which
takes a <code>char *</code> argument:
</p>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #8cd0d3;">void</span> <span style="color: #8cd0d3;">my_callback</span>(<span style="color: #8cd0d3;">char</span> *<span style="color: #dfaf8f;">msg</span>)
{
    printf(<span style="color: #cc9393;">"%s\n"</span>, msg);
}
</pre>
</div>
<p>
When we want to feed <code>my_callback</code> to function <code>process</code>, the compiler
will report warning.
</p>

<p>
In short, the behavior of casting function pointers(no matter explict
or not) is undefined. However in practice, if the function parameters
are pointer type, they are of the same size, just like the case
above. So it will work but that is non-standard.
</p>

<p>
For more detail, check the link below.
</p>

<ul class="org-ul">
<li><a href="http://stackoverflow.com/questions/559581/casting-a-function-pointer-to-another-type">Casting a Function Pointer to Another Type</a>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<a href="#" class="back-to-top">Back to Top</a>

<!-- <hr class="comment"> -->
<!-- <div id="show_source"> -->
<!--   <input type="button" value="Show Org source" onClick='show_org_source()'> -->
<!-- </div> -->

</script>
<hr class="comment">
<section class="comment">
<!-- An element a visitor can click if they <3 comments! -->
<button class="btn show-comments">Load Disqus comments</button>
<div id="disqus_thread"></div>
 
<!-- The empty element required for Disqus to loads comments into -->
<!--<div id="disqus_thread"></div>-->
    <!--<script type="text/javascript">-->
        <!--/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */-->
        <!--var disqus_shortname = 'lotaboutvimwiki'; // required: replace example with your forum shortname-->

        <!--/* * * DON'T EDIT BELOW THIS LINE * * */-->
        <!--(function() {-->
            <!--var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;-->
            <!--dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';-->
            <!--(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);-->
        <!--})();-->
    <!--</script>-->
    <!--<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>-->
</section>

<footer>
    |采用<a href="http://creativecommons.org/licenses/by-nc-sa/3.0/">CC BY-NC-SA 3.0</a>授权|由<a href="http://orgmode.org">Org Mode</a>自动生成<input type="button" value="Show Org source" onClick='show_org_source()'>|部署在<a href="https://github.com/lotabout/orgwiki">Github Pages</a>|
</footer>

    <script src="assets/js/jquery-1.7.1.min.js"></script>
    <script>
$(document).ready(function(){
	var offset = 100;
	var duration = 110;

        $(window).resize(function () {
            var toc= $('#table-of-contents')
            if ($(window).width() <= 800) {
                toc.css('position', 'static')
	        return
            }
            });
        $(window).scroll(
            function () {
            console.log("scroll called.")
            var toc= $('#table-of-contents')
            if ($(window).width() <= 800) {
            toc.css('position', 'static')
            return
            }

            if ($(this).scrollTop() > duration) {
            toc.css('left', toc.position().left + 'px')
            toc.css('position', 'fixed')
            $('.back-to-top').fadeIn(duration);
            } else {
            toc.css('left', '0px')
            toc.css('top', '0px')
            toc.css('position', 'relative')
            $('.back-to-top').fadeOut(duration);
            }
            });
        $('.back-to-top').click(
            function(event) {
            event.preventDefault;
            $('html, body').animate({scrollTop: 0}, duration);
            return false;
            });

        $('.show-comments').on('click', function(){
                               var disqus_shortname = 'lotaboutorgwiki'; // Replace this value with *your* username.

                               // ajax request to load the disqus javascript
                               $.ajax({
type: "GET",
url: "http://" + disqus_shortname + ".disqus.com/embed.js",
dataType: "script",
cache: true
});
                               // hide the button once comments load
                               $(this).fadeOut();
                               });
});
    </script>
</div>
</body>
</html>
